josediegosantillan/perro_guardian_wifi/sdkconfig.defaults
# Target por defecto
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y

# Task Watchdog Timer: vigila que las tareas criticas sigan vivas.
# Si una tarea suscrita deja de alimentar el TWDT, el ESP se reinicia y el
# rele vuelve a su estado seguro (router encendido por contacto NC).
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_PANIC=y

# Valores seguros por defecto del perro guardian.
CONFIG_ROUTER_WATCHDOG_ROUTER_BOOT_WAIT_MS=180000
CONFIG_ROUTER_WATCHDOG_INTERNET_CHECK_TIMEOUT_MS=5000
CONFIG_ROUTER_WATCHDOG_POWER_CYCLE_MAX_PER_WINDOW=3
CONFIG_ROUTER_WATCHDOG_POWER_CYCLE_WINDOW_MS=3600000
CONFIG_ROUTER_WATCHDOG_COOLDOWN_AFTER_LIMIT_MS=1800000
CONFIG_ROUTER_WATCHDOG_RELAY_GPIO=26
CONFIG_ROUTER_WATCHDOG_MANUAL_RESET_BUTTON_GPIO=32
CONFIG_ROUTER_WATCHDOG_MANUAL_RESET_BUTTON_ACTIVE_LEVEL=0
CONFIG_ROUTER_WATCHDOG_FORCE_PORTAL_GPIO=33
CONFIG_ROUTER_WATCHDOG_FORCE_PORTAL_ACTIVE_LEVEL=0
CONFIG_ROUTER_WATCHDOG_STATUS_LED_WIFI_GPIO=16
CONFIG_ROUTER_WATCHDOG_STATUS_LED_INTERNET_GPIO=17
CONFIG_ROUTER_WATCHDOG_STATUS_LED_ALERT_GPIO=27
CONFIG_ROUTER_WATCHDOG_STATUS_LED_ACTIVE_LEVEL=1
CONFIG_ROUTER_WATCHDOG_OLED_ENABLED=y
CONFIG_ROUTER_WATCHDOG_OLED_SDA_GPIO=21
CONFIG_ROUTER_WATCHDOG_OLED_SCL_GPIO=22
CONFIG_ROUTER_WATCHDOG_OLED_I2C_ADDRESS=0x3C
CONFIG_ROUTER_WATCHDOG_OLED_COLUMN_OFFSET=2
CONFIG_ROUTER_WATCHDOG_STRICT_HTTP_204=y
